In [49]:
%pip install mysql-connector-python
import mysql.connector as conn

Requirement already satisfied: mysql-connector-python in /Users/christelllameda/anaconda3/envs/clase/lib/python3.10/site-packages (8.2.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in /Users/christelllameda/anaconda3/envs/clase/lib/python3.10/site-packages (from mysql-connector-python) (4.21.12)
Note: you may need to restart the kernel to use updated packages.

In [59]:
conexion = conn.connect(host='localhost',  
                       user='root',        
                       passwd='password', 
                       )

cursor = conexion.cursor()
cursor.execute('create database movies;')

In [60]:
str_conn = 'mysql+pymysql://root:password@localhost:3306/movies'


cursor = create_engine(str_conn)

In [61]:
data = pd.read_csv('/Users/christelllameda/ironhack/Proyecto-Nro-2/data/csv_limpios/inventory_clean.csv', encoding='latin1')

data.to_sql(name='inventory',      # nombre de la tabla
            con=cursor,          # conexion al servidor
            if_exists='replace',  # reemplaza la tabla si existe
            index=True
           )

1000

In [56]:
cursor.execute('show tables;').fetchall()

[('actor',), ('language',)]

In [57]:
df2 = pd.read_sql('select * from actor limit 3;', cursor)

df2

   index actor_id\tfirst_name\tlast_name
0      0            1\tPENELOPE\tGUINESS
1      1               2\tNICK\tWAHLBERG
2      2                    3\tED\tCHASE